TA/app/views/users/_cal_create.html.erb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."student_id" = ? AND "appointments"."confirmed" = ?  [["student_id", 26], ["confirmed", true]]
---
			<%tas= current_user%>
			<%studentapp = current_user.student_appointments.where(confirmed: true)%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 26], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" INNER JOIN "enrollments" ON "courses"."id" = "enrollments"."course_id" WHERE "enrollments"."user_id" = ?  [["user_id", 26]]
---
							<div class = 'time-added'>
								<h5 class = 'offhour' style = "margin-bottom:0px"><%=User.find(correct_hour.ta_id).first_name%>: <%=Course.find(correct_hour.course_id).abbrev%>