TA/app/views/users/_student_appointments.html.erb

              <%listed = true%>
              <p>Appointment between <%=User.find(app.ta_id).first_name%> and <%=User.find(app.student_id).first_name%> for course: <%=Course.find(app.course_id).name%> Time: <%=app.start.strftime('%y-%m-%d at %I:%M:%S%p')%>
---
SELECT "courses".* FROM "courses" INNER JOIN "enrollment_tas" ON "courses"."id" = "enrollment_tas"."course_id" WHERE "enrollment_tas"."user_id" = ?  [["user_id", 2]]