TA/app/controllers/appointments_controller.rb

  def confirm_app
    @appointment = Appointment.find(params[:id])
    # @appointment.confirmed = params[:confirmed]
    respond_to do |format|
      if @appointment.update_attribute(:confirmed, params[:confirmed])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "appointments" SET "confirmed" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["confirmed", true], ["updated_at", 2017-05-15 04:27:30 UTC], ["id", 1]]

  def unconfirm_app
    @appointment = Appointment.find(params[:id])
    # @appointment.confirmed = params[:confirmed]
    respond_to do |format|
      if @appointment.update_attribute(:confirmed, params[:confirmed])
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "appointments" SET "confirmed" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["confirmed", false], ["updated_at", 2017-05-15 04:27:31 UTC], ["id", 1]]